#+TITLE: Teaching Portfolio
#+Author: Brice Ozenne

** Computing summary statistics

#+LaTeX: \RecustomVerbatimEnvironment{verbatim}{Verbatim}{formatcom = {\color[rgb]{0.5,0,0}}}

Initially, we were teaching the students to use the =aggregate=
function to evaluate the mean and other statistics per timepoint:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
w.summaries <- aggregate(glucagonAUC~time, data=gastricbypassL,
                         FUN = function(iAUC){
  c("observed" = sum(!is.na(iAUC)),
    "missing" = sum(is.na(iAUC)),
    "mean" = mean(iAUC, na.rm = TRUE),
    "sd" = sd(iAUC, na.rm = TRUE),
    "min" = min(iAUC, na.rm = TRUE),
    "median" = median(iAUC, na.rm = TRUE),
    "max" = max(iAUC, na.rm = TRUE))},
  na.action=na.pass)
                               
w.summaries <- data.frame(w.summaries[1],w.summaries[[2]])
print(w.summaries, digits=4)

#+END_SRC

#+RESULTS:
:            time observed missing  mean   sd  min median   max
: 1 3monthsBefore       20       0  7860 3781 2500   6786 16798
: 2   1weekBefore       19       1  7149 3289 2376   6202 16300
: 3    1weekAfter       19       1 16954 6153 7906  16269 29980
: 4  3monthsAfter       20       0 11063 4479 4551  10911 23246

While this is a very flexible approach, it was difficult for medical
students to understand. Instead we now use the =summarize= function
from LMMstar which has well suited default output for the applications
we have in mind in the course:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summarize(glucagonAUC ~ time|id, data = gastricbypassL, na.rm = TRUE)
#+END_SRC

#+RESULTS:
#+begin_example
           time observed missing      mean       sd    min        q1  median       q3      max
1 3monthsBefore       20       0  7860.443 3781.459 2500.5  5185.875  6786.0 10337.51 16797.75
2   1weekBefore       19       1  7148.589 3288.933 2376.0  5113.500  6202.5  8082.75 16300.50
3    1weekAfter       19       1 16953.671 6152.867 7906.5 12466.500 16269.0 20271.00 29979.75
4  3monthsAfter       20       0 11063.025 4479.478 4551.0  7914.225 10911.0 12340.50 23245.50

 Pearson's correlation: 
              3monthsBefore 1weekBefore  1weekAfter 3monthsAfter
3monthsBefore     1.0000000  0.83158346  0.13902263   -0.2496747
1weekBefore       0.8315835  1.00000000 -0.09418889   -0.2232003
1weekAfter        0.1390226 -0.09418889  1.00000000    0.5988570
3monthsAfter     -0.2496747 -0.22320033  0.59885696    1.0000000
#+end_example

Note that key arguments, such as how to handle missing data are kept
to stress their importance to the students. One functionality has been
added to obtain the correlation matrix by explaining in the formula
interface how the data are grouped. This enable to have a single
statement outputing all the standard descriptive statistics. The
student can now focus on the interpretation of these statistics and
their implication in term of statistical modeling.

** Fitting linear mixed models

Another difficulty was to estimate linear mixed models with
unstructured covariance patterns. We advocate their use during the
course but, at the time, the \Rlogo syntax was complicated:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
fit.main <- gls(glucagonAUC ~ time,
                data = gastricbypassL,
                correlation = corSymm(form=~as.numeric(time)|id),
                weights = varIdent(form=~1|time),
                na.action=  na.exclude,
                control = glsControl(opt="optim"))
logLik(fit.main)
#+END_SRC

#+RESULTS:
: 'log Lik.' -712.161 (df=14)

We developped our own mixed model implementation, with a simpler
syntax that stresses the choice of the covariance structure (one of
the learning point of the course):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
fit.main2 <- lmm(glucagonAUC ~ time,
                data = gastricbypassL,
                repetition = ~time|id,
                structure = "UN")
logLik(fit.main2)
#+END_SRC

#+RESULTS:
: [1] -712.161

\clearpage 

